dataset_gen/Earlier_Datasets/CE-CRP_openfoam/Design_Point_0/0/U
FoamFile
{
    version 2.0;
    format ascii;
    class volVectorField;
    object U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   nonuniform List<vector>
16384
(
(-0.7181515500504747 0.6043939615080793 0)
(0.5444895385933148 -0.6025686369316552 0)
(0.41371468769523423 0.4580143360819746 0)
(-0.2830685429114548 -0.7682618809497406 0)
(-0.3382039502947016 -0.8728832994279527 0)
(0.45921235667612814 0.27511494271042625 0)
(-0.7608115081233966 0.42648957444599 0)
(0.541934359909122 -0.012408807271218514 0)
...
)
;

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    frontAndBack
    {
        type            empty;
    }
}
